In [1]:
# 판다스 라이브러리 임포트
import pandas as pd

# 데이터 확인

In [2]:
pwd

'd:\\study\\python\\pandas-study'

In [9]:
# csv 파일 읽기
df = pd.read_csv('./data/gapminder.tsv', sep = '\t')

In [10]:
# head()는 상위 5개의 행을 출력
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [11]:
type(df)

pandas.core.frame.DataFrame

In [12]:
df.shape # (행, 열)

(1704, 6)

In [13]:
# 컬럼명(필드)목록 출력
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [15]:
df.dtypes # 데이터프레임 값의 자료형 확인

country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

**판다스와 파이썬 자료형**
- 문자열
    - 파이썬 : string
    - 판다스 : object

- 정수
    - 파이썬 : list
    - 판다스 : int64

- 실수
    - 파이썬 : float
    - 판다스 : float64

- datetime
    - 파이썬 : datetime
    - 판다스 : datetime64

# 데이터 추출

In [17]:
df['country']

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

In [18]:
type(df['country'])

pandas.core.series.Series

In [19]:
country_se = df['country']

In [20]:
country_se.head()

0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: country, dtype: object

In [21]:
country_se.tail()

1699    Zimbabwe
1700    Zimbabwe
1701    Zimbabwe
1702    Zimbabwe
1703    Zimbabwe
Name: country, dtype: object

In [24]:
subset = df[['country', 'continent', 'year']] # [[]] 두개가 있으면 데이터프레임 형태로 추출

In [25]:
subset.head()

       country continent  year
0  Afghanistan      Asia  1952
1  Afghanistan      Asia  1957
2  Afghanistan      Asia  1962
3  Afghanistan      Asia  1967
4  Afghanistan      Asia  1972

## 행단위 데이터 추출

- loc
    - 인덱스를 기준으로 행 데이터 추출
- iloc
    - 행 번호를 기준으로 행 데이터 추출

### loc

In [26]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [27]:
df.loc[0]

country      Afghanistan
continent           Asia
year                1952
lifeExp           28.801
pop              8425333
gdpPercap        779.445
Name: 0, dtype: object

In [28]:
df.loc[99]

country      Bangladesh
continent          Asia
year               1967
lifeExp          43.453
pop            62821884
gdpPercap       721.186
Name: 99, dtype: object

In [29]:
type(df.loc[0])

pandas.core.series.Series

In [30]:
df.loc[0].index

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [31]:
# ord() : 문자를 전달하면 해당 문자의 유니코드 값을 반환
# chr() : 특정 문자의 유니코드 값을 전달하면 해당 문자를 반환

ord('a'), ord('z')

(97, 122)

In [32]:
for i in range(97, 123) :
    print(chr(i), end = ' ')

a b c d e f g h i j k l m n o p q r s t u v w x y z

In [36]:
df_index = pd.DataFrame({'value' : [i for i in range(26)]},
                       index = [chr(i) for i in range(97, 123)])

In [40]:
df_index.head()

   value
a      0
b      1
c      2
d      3
e      4

In [38]:
value = []

for i in range(26) :
    value.append(i)

In [41]:
df_index.loc['a']

value    0
Name: a, dtype: int64

In [44]:
df_index.loc['z']

   value
z     25

In [45]:
df_index.loc[['a']]

   value
a      0

In [46]:
df_index.loc[['a', 'c']]

   value
a      0
c      2

In [49]:
# loc으로 마지막 행 추출하기
num_rows = df.shape[0] # len(df)
last_row = num_rows - 1

In [50]:
df.loc[last_row]

country      Zimbabwe
continent      Africa
year             2007
lifeExp        43.487
pop          12311143
gdpPercap     469.709
Name: 1703, dtype: object

In [51]:
df.tail(1)

       country continent  year  lifeExp       pop   gdpPercap
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [52]:
df.loc[[0, 99, 999]]

         country continent  year  lifeExp       pop    gdpPercap
0    Afghanistan      Asia  1952   28.801   8425333   779.445314
99    Bangladesh      Asia  1967   43.453  62821884   721.186086
999     Mongolia      Asia  1967   51.253   1149500  1226.041130

#### iloc

In [53]:
df.iloc[1]

country      Afghanistan
continent           Asia
year                1957
lifeExp           30.332
pop              9240934
gdpPercap        820.853
Name: 1, dtype: object

In [54]:
df.iloc[99], '', df.loc[99]

(country      Bangladesh
 continent          Asia
 year               1967
 lifeExp          43.453
 pop            62821884
 gdpPercap       721.186
 Name: 99, dtype: object,
 '',
 country      Bangladesh
 continent          Asia
 year               1967
 lifeExp          43.453
 pop            62821884
 gdpPercap       721.186
 Name: 99, dtype: object)

In [55]:
df.iloc[-1]

country      Zimbabwe
continent      Africa
year             2007
lifeExp        43.487
pop          12311143
gdpPercap     469.709
Name: 1703, dtype: object

In [56]:
df_index.iloc[0]

value    0
Name: a, dtype: int64

In [57]:
df_index.iloc[10]

value    10
Name: k, dtype: int64

## 행과 열 추출

In [58]:
df.loc[:, 'year']

0       1952
1       1957
2       1962
3       1967
4       1972
        ...
1699    1987
1700    1992
1701    1997
1702    2002
1703    2007
Name: year, Length: 1704, dtype: int64

In [59]:
df.loc[:, ['year', 'pop']].head()

   year       pop
0  1952   8425333
1  1957   9240934
2  1962  10267083
3  1967  11537966
4  1972  13079460

In [63]:
df.iloc[:, [2, 4, -1]].head()

   year       pop   gdpPercap
0  1952   8425333  779.445314
1  1957   9240934  820.853030
2  1962  10267083  853.100710
3  1967  11537966  836.197138
4  1972  13079460  739.981106

In [64]:
df.iloc[:5, :3]

       country continent  year
0  Afghanistan      Asia  1952
1  Afghanistan      Asia  1957
2  Afghanistan      Asia  1962
3  Afghanistan      Asia  1967
4  Afghanistan      Asia  1972

In [66]:
df.iloc[:, 0:6:2].head()

       country  year       pop
0  Afghanistan  1952   8425333
1  Afghanistan  1957   9240934
2  Afghanistan  1962  10267083
3  Afghanistan  1967  11537966
4  Afghanistan  1972  13079460

In [67]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [68]:
df.iloc[[0, 99, 999], [0, 3, 5]]

         country  lifeExp    gdpPercap
0    Afghanistan   28.801   779.445314
99    Bangladesh   43.453   721.186086
999     Mongolia   51.253  1226.041130

In [70]:
df.loc[[0, 99, 999], ['country', 'lifeExp', 'gdpPercap']]

         country  lifeExp    gdpPercap
0    Afghanistan   28.801   779.445314
99    Bangladesh   43.453   721.186086
999     Mongolia   51.253  1226.041130

# 기초적인 통계 계산

In [71]:
df.describe() #summary

             year      lifeExp           pop      gdpPercap
count  1704.00000  1704.000000  1.704000e+03    1704.000000
mean   1979.50000    59.474439  2.960121e+07    7215.327081
std      17.26533    12.917107  1.061579e+08    9857.454543
min    1952.00000    23.599000  6.001100e+04     241.165877
25%    1965.75000    48.198000  2.793664e+06    1202.060309
50%    1979.50000    60.712500  7.023596e+06    3531.846989
75%    1993.25000    70.845500  1.958522e+07    9325.462346
max    2007.00000    82.603000  1.318683e+09  113523.132900

## 그룹화한 데이터의 평균 구하기

In [72]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [74]:
df.groupby('year')['lifeExp'].mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [75]:
df.groupby(['year', 'continent'])[['lifeExp', 'gdpPercap']].mean()

                  lifeExp     gdpPercap
year continent
1952 Africa     39.135500   1252.572466
     Americas   53.279840   4079.062552
     Asia       46.314394   5195.484004
     Europe     64.408500   5661.057435
     Oceania    69.255000  10298.085650
1957 Africa     41.266346   1385.236062
     Americas   55.960280   4616.043733
     Asia       49.318544   5787.732940
     Europe     66.703067   6963.012816
     Oceania    70.295000  11598.522455
1962 Africa     43.319442   1598.078825
     Americas   58.398760   4901.541870
     Asia       51.563223   5729.369625
     Europe     68.539233   8365.486814
     Oceania    71.085000  12696.452430
1967 Africa     45.334538   2050.363801
     Americas   60.410920   5668.253496
     Asia       54.663640   5971.173374
     Europe     69.737600  10143.823757
     Oceania    71.310000  14495.021790
1972 Africa     47.450942   2339.615674
     Americas   62.394920   6491.334139
     Asia       57.319269   8187.468699
     Europe     70.775033  12479.575246
     Oceania    71.910000  16417.333380
1977 Africa     49.580423   2585.938508
     Americas   64.391560   7352.007126
     Asia       59.610556   7791.314020
     Europe     71.937767  14283.979110
     Oceania    72.855000  17283.957605
1982 Africa     51.592865   2481.592960
     Americas   66.228840   7506.737088
     Asia       62.617939   7434.135157
     Europe     72.806400  15617.896551
     Oceania    74.290000  18554.709840
1987 Africa     53.344788   2282.668991
     Americas   68.090720   7793.400261
     Asia       64.851182   7608.226508
     Europe     73.642167  17214.310727
     Oceania    75.320000  20448.040160
1992 Africa     53.629577   2281.810333
     Americas   69.568360   8044.934406
     Asia       66.537212   8639.690248
     Europe     74.440100  17061.568084
     Oceania    76.945000  20894.045885
1997 Africa     53.598269   2378.759555
     Americas   71.150480   8889.300863
     Asia       68.020515   9834.093295
     Europe     75.505167  19076.781802
     Oceania    78.190000  24024.175170
2002 Africa     53.325231   2599.385159
     Americas   72.422040   9287.677107
     Asia       69.233879  10174.090397
     Europe     76.700600  21711.732422
     Oceania    79.740000  26938.778040
2007 Africa     54.806038   3089.032605
     Americas   73.608120  11003.031625
     Asia       70.728485  12473.026870
     Europe     77.648600  25054.481636
     Oceania    80.719500  29810.188275

### 그룹화한 데이터 개수 세기

In [78]:
df.groupby('continent')['country'].nunique() # country의 개수

continent
Africa      52
Americas    25
Asia        33
Europe      30
Oceania      2
Name: country, dtype: int64

In [79]:
df.groupby('continent')['country'].value_counts() # 각 country별 데이터 개수

continent  country
Africa     Algeria           12
           Angola            12
           Benin             12
           Botswana          12
           Burkina Faso      12
                             ..
Europe     Switzerland       12
           Turkey            12
           United Kingdom    12
Oceania    Australia         12
           New Zealand       12
Name: country, Length: 142, dtype: int64

In [80]:
df.groupby('continent')['country'].count() # 각 continent 별 데이터 대수

continent
Africa      624
Americas    300
Asia        396
Europe      360
Oceania      24
Name: country, dtype: int64

## 데이터 생성

In [81]:
pd.Series(['banana', 42])

0    banana
1        42
dtype: object

In [83]:
pd.Series(['Wes McKinney', 'Creator of Pandas'])

0         Wes McKinney
1    Creator of Pandas
dtype: object

In [84]:
pd.DataFrame(
    data = {'Occupation' : ['Chemist', 'Statistictian'],
           'Born' : ['1920-07-25', '1876-06-13'],
           'Died' : ['1958-04-16', '1937-10-16'],
            'Age' : [37, 61]},
    index = ['Rosaline Frank', 'William Gosset'],
    columns = ['Occupation', 'Born', 'Age', 'Died'])

                   Occupation        Born  Age        Died
Rosaline Frank        Chemist  1920-07-25   37  1958-04-16
William Gosset  Statistictian  1876-06-13   61  1937-10-16

## 시리즈 다루기

In [85]:
scientists = pd.DataFrame(
    data = {'Occupation' : ['Chemist', 'Statistictian'],
           'Born' : ['1920-07-25', '1876-06-13'],
           'Died' : ['1958-04-16', '1937-10-16'],
            'Age' : [37, 61]},
    index = ['Rosaline Frank', 'William Gosset'],
    columns = ['Occupation', 'Born', 'Age', 'Died'])

In [86]:
scientists.loc['William Gosset']

Occupation    Statistictian
Born             1876-06-13
Age                      61
Died             1937-10-16
Name: William Gosset, dtype: object

In [87]:
type(scientists.loc['William Gosset'])

pandas.core.series.Series

In [88]:
scientists.loc['William Gosset'].index

Index(['Occupation', 'Born', 'Age', 'Died'], dtype='object')

In [89]:
scientists.loc['William Gosset'].values

array(['Statistictian', '1876-06-13', 61, '1937-10-16'], dtype=object)

In [90]:
scientists.loc['William Gosset'].keys()

Index(['Occupation', 'Born', 'Age', 'Died'], dtype='object')

In [91]:
scientists.loc['William Gosset'].index[0]

'Occupation'

### 시리즈에 기초통계 메서드 사용

In [92]:
scientists['Age'].mean()

49.0

In [93]:
scientists['Age'].min()

37

In [94]:
scientists['Age'].max()

61

In [95]:
scientists['Age'].std()

16.97056274847714

In [99]:
scientists = pd.read_csv('./data/scientists.csv')

In [100]:
scientists['Age'].max()

90

In [101]:
scientists['Age'].mean()

59.125

In [102]:
scientist

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

## 시리즈 다루기 응용

In [103]:
ages = scientists['Age']

In [105]:
ages[ages > ages.mean()] # 평균보다 나이가 많은 사람의 데이터 추출

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [106]:
ages > ages.mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [110]:
ages + ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [111]:
ages * ages

0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

In [113]:
ages + 100

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [114]:
ages* 2

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [117]:
ages + pd.Series([1, 100]) # 길이가 서로 다른 벡터를 연산하면 인덱스가 일치한 데이터만 계산함

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [118]:
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [120]:
ages.sort_index(ascending = False) # 데이터의 정렬이 아니라 인덱스의 정렬

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [121]:
ages * 2, '', ages + ages.sort_index(ascending = False) # 눈에 보이는 순서대로 연산하는 것이 아닌 인덱스가 일치하는 값끼리 연산

(0     74
 1    122
 2    180
 3    132
 4    112
 5     90
 6     82
 7    154
 Name: Age, dtype: int64,
 '',
 0     74
 1    122
 2    180
 3    132
 4    112
 5     90
 6     82
 7    154
 Name: Age, dtype: int64)

## 데이터프레임 다루기

In [122]:
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [126]:
scientists[scientists['Age'] > scientists['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [127]:
scientists['Age'] > scientists['Age'].mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [128]:
scientists * 2

,Name,Born,Died,Age,Occupation
0,Rosaline FranklinRosaline Franklin,1920-07-251920-07-25,1958-04-161958-04-16,74,ChemistChemist
1,William GossetWilliam Gosset,1876-06-131876-06-13,1937-10-161937-10-16,122,StatisticianStatistician
2,Florence NightingaleFlorence Nightingale,1820-05-121820-05-12,1910-08-131910-08-13,180,NurseNurse
3,Marie CurieMarie Curie,1867-11-071867-11-07,1934-07-041934-07-04,132,ChemistChemist
4,Rachel CarsonRachel Carson,1907-05-271907-05-27,1964-04-141964-04-14,112,BiologistBiologist
5,John SnowJohn Snow,1813-03-151813-03-15,1858-06-161858-06-16,90,PhysicianPhysician
6,Alan TuringAlan Turing,1912-06-231912-06-23,1954-06-071954-06-07,82,Computer ScientistComputer Scientist
7,Johann GaussJohann Gauss,1777-04-301777-04-30,1855-02-231855-02-23,154,MathematicianMathematician

## 시리즈와 데이터프레임 처리

In [129]:
scientists.dtypes

Name          object
Born          object
Died          object
Age            int64
Occupation    object
dtype: object

In [130]:
pd.to_datetime(scientists['Born'], format = '%Y-%m-%d')

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [131]:
pd.to_datetime(scientists['Died'], format = '%Y-%m-%d')

0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [143]:
scientists['born_dt'] = pd.to_datetime(scientists['Born'], format = '%Y-%m-%d')
scientists['died_dt'] = pd.to_datetime(scientists['Died'], format = '%Y-%m-%d')

In [144]:
scientists.dtypes

Name                  object
Born                  object
Died                  object
Age                    int64
Occupation            object
Born_dt       datetime64[ns]
born_dt       datetime64[ns]
died_dt       datetime64[ns]
dtype: object

In [147]:
scientists['age_days'] = scientists['died_dt'] - scientists['born_dt']

In [149]:
scientists

,Name,Born,Died,Age,Occupation,Born_dt,born_dt,died_dt,age_days
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1777-04-30,1855-02-23,28422 days

## 데이터 섞기

In [150]:
import random

In [152]:
random.shuffle(scientists['Age'])

C:\ProgramData\Anaconda3\lib\random.py:307: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x[i], x[j] = x[j], x[i]

In [154]:
scientists['Age']

0    90
1    45
2    41
3    56
4    61
5    66
6    77
7    37
Name: Age, dtype: int64

## 열 삭제하기

In [157]:
scientists.columns

Index(['Name', 'Born', 'Died', 'Age', 'Occupation', 'Born_dt', 'born_dt',
       'died_dt', 'age_days'],
      dtype='object')

In [158]:
scientists.drop(['Age'], axis = 1)

,Name,Born,Died,Occupation,Born_dt,born_dt,died_dt,age_days
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,Nurse,1820-05-12,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,Chemist,1867-11-07,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,Biologist,1907-05-27,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,Physician,1813-03-15,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,Computer Scientist,1912-06-23,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,Mathematician,1777-04-30,1777-04-30,1855-02-23,28422 days

In [159]:
scientists

,Name,Born,Died,Age,Occupation,Born_dt,born_dt,died_dt,age_days
0,Rosaline Franklin,1920-07-25,1958-04-16,90,Chemist,1920-07-25,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,45,Statistician,1876-06-13,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,41,Nurse,1820-05-12,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,56,Chemist,1867-11-07,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,61,Biologist,1907-05-27,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,66,Physician,1813-03-15,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,77,Computer Scientist,1912-06-23,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,37,Mathematician,1777-04-30,1777-04-30,1855-02-23,28422 days

In [160]:
dropped = scientists.drop(['Age'], axis = 1)

In [161]:
dropped

,Name,Born,Died,Occupation,Born_dt,born_dt,died_dt,age_days
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,Nurse,1820-05-12,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,Chemist,1867-11-07,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,Biologist,1907-05-27,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,Physician,1813-03-15,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,Computer Scientist,1912-06-23,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,Mathematician,1777-04-30,1777-04-30,1855-02-23,28422 days

In [162]:
scientists.drop(['Age'], axis = 1, inplace = True) # 원본에 덮어씌우는 함수

In [163]:
scientists

,Name,Born,Died,Occupation,Born_dt,born_dt,died_dt,age_days
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,Nurse,1820-05-12,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,Chemist,1867-11-07,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,Biologist,1907-05-27,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,Physician,1813-03-15,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,Computer Scientist,1912-06-23,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,Mathematician,1777-04-30,1777-04-30,1855-02-23,28422 days

In [164]:
scientists.drop(['Born'], axis = 1, inplace = False)

,Name,Died,Occupation,Born_dt,born_dt,died_dt,age_days
0,Rosaline Franklin,1958-04-16,Chemist,1920-07-25,1920-07-25,1958-04-16,13779 days
1,William Gosset,1937-10-16,Statistician,1876-06-13,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1910-08-13,Nurse,1820-05-12,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1934-07-04,Chemist,1867-11-07,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1964-04-14,Biologist,1907-05-27,1907-05-27,1964-04-14,20777 days
5,John Snow,1858-06-16,Physician,1813-03-15,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1954-06-07,Computer Scientist,1912-06-23,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1855-02-23,Mathematician,1777-04-30,1777-04-30,1855-02-23,28422 days

In [165]:
scientists

,Name,Born,Died,Occupation,Born_dt,born_dt,died_dt,age_days
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,Nurse,1820-05-12,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,Chemist,1867-11-07,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,Biologist,1907-05-27,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,Physician,1813-03-15,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,Computer Scientist,1912-06-23,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,Mathematician,1777-04-30,1777-04-30,1855-02-23,28422 days

In [168]:
scientists.to_pickle('./scientists_drop.pkl')

In [169]:
pd.read_pickle('./scientists_drop.pkl')

,Name,Born,Died,Occupation,Born_dt,born_dt,died_dt,age_days
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,Nurse,1820-05-12,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,Chemist,1867-11-07,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,Biologist,1907-05-27,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,Physician,1813-03-15,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,Computer Scientist,1912-06-23,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,Mathematician,1777-04-30,1777-04-30,1855-02-23,28422 days

In [173]:
scientists.to_csv('scientists_drop.csv', index = False)

In [174]:
pd.read_csv('./scientists_drop.csv')

,Name,Born,Died,Occupation,Born_dt,born_dt,died_dt,age_days
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,Nurse,1820-05-12,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,Chemist,1867-11-07,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,Biologist,1907-05-27,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,Physician,1813-03-15,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,Computer Scientist,1912-06-23,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,Mathematician,1777-04-30,1777-04-30,1855-02-23,28422 days

In [176]:
scientists.to_excel('scientists_drop.xlsx', index = False)

In [177]:
pd.read_excel('./scientists_drop.xlsx')

,Name,Born,Died,Occupation,Born_dt,born_dt,died_dt,age_days
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1920-07-25,1958-04-16,13779
1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1876-06-13,1937-10-16,22404
2,Florence Nightingale,1820-05-12,1910-08-13,Nurse,1820-05-12,1820-05-12,1910-08-13,32964
3,Marie Curie,1867-11-07,1934-07-04,Chemist,1867-11-07,1867-11-07,1934-07-04,24345
4,Rachel Carson,1907-05-27,1964-04-14,Biologist,1907-05-27,1907-05-27,1964-04-14,20777
5,John Snow,1813-03-15,1858-06-16,Physician,1813-03-15,1813-03-15,1858-06-16,16529
6,Alan Turing,1912-06-23,1954-06-07,Computer Scientist,1912-06-23,1912-06-23,1954-06-07,15324
7,Johann Gauss,1777-04-30,1855-02-23,Mathematician,1777-04-30,1777-04-30,1855-02-23,28422